Repository: ibsoft/HashWhisper
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: el

source: Preferences
el: Προτιμήσεις

source: Quick Actions
el: Γρήγορες ενέργειες

source: Back to chat
el: Πίσω στη συνομιλία

source: Two-factor authentication
el: Έλεγχος ταυτότητας δύο παραγόντων

source: TOTP has been disabled by configuration.
el: Το TOTP έχει απενεργοποιηθεί από τη ρύθμιση.

source: Use an authenticator app (TOTP). Click setup to view the QR/code.
el: Χρησιμοποιήστε εφαρμογή επαλήθευσης (TOTP). Πατήστε ρύθμιση για να δείτε το QR/κωδικό.

source: Setup TOTP
el: Ρύθμιση TOTP

source: TOTP is required and enforced.
el: Το TOTP απαιτείται και εφαρμόζεται.

source: Themes and notifications are stored server-side without sensitive content.
el: Τα θέματα και οι ειδοποιήσεις αποθηκεύονται στον διακομιστή χωρίς ευαίσθητο περιεχόμενο.

source: Set up TOTP
el: Ρυθμίστε TOTP

source: Scan this QR with your authenticator app, or copy the code below.
el: Σαρώστε αυτό το QR με την εφαρμογή επαλήθευσης ή αντιγράψτε τον κωδικό.

source: Copy
el: Αντιγραφή

source: After scanning, save settings to enable.
el: Αφού σαρώσετε, αποθηκεύστε τις ρυθμίσεις για ενεργοποίηση.

source: Done
el: Έγινε

source: Settings updated
el: Οι ρυθμίσεις ενημερώθηκαν

source: A group with this name already exists.
el: Υπάρχει ήδη ομάδα με αυτό το όνομα.

source: Use 3-32 alphanumeric/._- characters
el: Χρησιμοποιήστε 3-32 αλφαριθμητικούς/._- χαρακτήρες

source: Username
el: Όνομα χρήστη

source: Password
el: Κωδικός πρόσβασης

source: Use at least 12 characters
el: Χρησιμοποιήστε τουλάχιστον 12 χαρακτήρες

source: Include upper, lower, digit, and symbol
el: Συμπεριλάβετε κεφαλαίο, πεζό, αριθμό και σύμβολο

source: Confirm Password
el: Επιβεβαίωση κωδικού

source: Create account
el: Δημιουργία λογαριασμού

source: Username or Email
el: Όνομα χρήστη ή Email

source: Remember me
el: Να με θυμάσαι

source: Sign in
el: Σύνδεση

source: Authenticator code
el: Κωδικός εφαρμογής επαλήθευσης

source: Verify
el: Επαλήθευση

source: Group name
el: Όνομα ομάδας

source: Group secret
el: Μυστικό ομάδας

source: Create group
el: Δημιουργία ομάδας

source: Theme
el: Θέμα

source: System
el: Σύστημα

source: Light
el: Φωτεινό

source: Dark
el: Σκούρο

source: Language
el: Γλώσσα

source: Enable notifications
el: Ενεργοποίηση ειδοποιήσεων

source: Time zone
el: Ζώνη ώρας

source: Favorites
el: Αγαπημένα

source: Scheduled chats
el: Προγραμματισμένες συνομιλίες

source: Schedule chat
el: Προγραμματισμός συνομιλίας

source: Name
el: Όνομα

source: Start time
el: Ώρα έναρξης

source: End time
el: Ώρα λήξης

source: Never expire
el: Να μην λήγει

source: Invite favorites
el: Πρόσκληση αγαπημένων

source: No favorites yet.
el: Δεν υπάρχουν αγαπημένοι ακόμη.

source: Whisper Rooms
el: Δωμάτια ψιθύρων!

source: Users
el: Χρήστες

source: Join securely
el: Σύνδεση με ασφάλεια

source: Join via secret hash
el: Συμμετοχή μέσω μυστικού μυστικού

source: Cancel
el: Άκυρο

source: Create
el: Δημιουργία

source: Delete scheduled chat
el: Διαγραφή προγραμματισμένης συνομιλίας

source: Are you sure you want to delete this scheduled chat?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την προγραμματισμένη συνομιλία;

source: This cannot be undone.
el: Αυτό δεν μπορεί να αναιρεθεί.

source: No scheduled chats yet.
el: Δεν υπάρχουν προγραμματισμένες συνομιλίες ακόμη.

source: Paste shared secret
el: Επικόλληση κοινόχρηστου μυστικού

source: Select a group
el: Επιλέξτε μια ομάδα

source: Documentation
el: Τεκμηρίωση

source: User Manual
el: Εγχειρίδιο χρήστη

source: Scan QR code
el: Σάρωση QR κώδικα

source: Secure vault
el: Ασφαλές θησαυροφυλάκιο

source: This link delivers a one-time secret. Open it only from trusted devices; it burns after it is read or when it expires.
el: Αυτός ο σύνδεσμος παρέχει ένα μυστικό μίας χρήσης. Ανοίξτε τον μόνο από αξιόπιστες συσκευές· αυτοκαταστρέφεται αφότου διαβαστεί ή όταν λήξει.

source: Untouched
el: Αχρησιμοποίητο

source: Secret key (the part after the # in the link)
el: Μυστικό κλειδί (το μέρος μετά το # στον σύνδεσμο)

source: Paste or scan the link and include the secret
el: Επικολλήστε ή σαρώστε τον σύνδεσμο και συμπεριλάβετε το μυστικό

source: Auto-fill from URL
el: Αυτόματη συμπλήρωση από το URL

source: Only the bearer of this secret key can decrypt the message. The server never stores it.
el: Μόνο ο κάτοχος αυτού του μυστικού κλειδιού μπορεί να αποκρυπτογραφήσει το μήνυμα. Ο διακομιστής δεν το αποθηκεύει ποτέ.

source: Secret key auto-filled from the link.
el: Το μυστικό κλειδί συμπληρώθηκε αυτόματα από τον σύνδεσμο.

source: This link does not include the secret key fragment.
el: Αυτός ο σύνδεσμος δεν περιλαμβάνει το τμήμα μυστικού κλειδιού.

source: Decrypt secret
el: Αποκρυπτογράφηση μυστικού

source: Clear key and message
el: Καθαρισμός κλειδιού και μηνύματος

source: Download file
el: Λήψη αρχείου

source: Binary file ready to download below.
el: Το δυαδικό αρχείο είναι έτοιμο για λήψη παρακάτω.

source: File ready to download.
el: Το αρχείο είναι έτοιμο για λήψη.

source: Secret file
el: Μυστικό αρχείο

source: File secret
el: Μυστικό αρχείου

source: Text secret
el: Μυστικό κειμένου

source: Expires
el: Λήγει

source: Views left
el: Υπόλοιπες προβολές

source: Never
el: Ποτέ

source: Untitled secret
el: Μυστικό χωρίς τίτλο

source: Provide the secret key to decrypt the payload.
el: Δώστε το μυστικό κλειδί για να αποκρυπτογραφήσετε τα δεδομένα.

source: Provide some text or attach a file.
el: Προσθέστε κάποιο κείμενο ή επισυνάψτε αρχείο.

source: File attached:
el: Επισυναπτόμενο αρχείο:

source: Share link
el: Κοινή χρήση συνδέσμου

source: HashWhisper secret link
el: Ασφαλής σύνδεσμος HashWhisper

source: Share this secure link.
el: Κοινόχρηστος ασφαλής σύνδεσμος.

source: Payload missing.
el: Λείπει το περιεχόμενο.

source: Secret ready. Paste the key and press decrypt.
el: Το μυστικό είναι έτοιμο. Επικολλήστε το κλειδί και πατήστε αποκρυπτογράφηση.

source: Secret not found.
el: Το μυστικό δεν βρέθηκε.

source: This secret has burned.
el: Αυτό το μυστικό έχει καταστραφεί.

source: Unavailable
el: Μη διαθέσιμο

source: Ready to decrypt
el: Έτοιμο για αποκρυπτογράφηση

source: Unable to load this secret. It may have burned.
el: Δεν είναι δυνατή η φόρτωση αυτού του μυστικού. Ίσως έχει καταστραφεί.

source: Offline
el: Εκτός σύνδεσης

source: Add the secret key first.
el: Προσθέστε πρώτα το μυστικό κλειδί.

source: Key and decrypted message cleared.
el: Το κλειδί και το αποκρυπτογραφημένο μήνυμα διαγράφηκαν.

source: Unlocked
el: Ξεκλείδωτο

source: Keep this window open only as long as you need.
el: Κρατήστε αυτό το παράθυρο ανοιχτό μόνο όσο χρειάζεται.

source: Unable to decrypt. Check the secret key and try again.
el: Δεν είναι δυνατή η αποκρυπτογράφηση. Ελέγξτε το μυστικό κλειδί και δοκιμάστε ξανά.

source: Secret link created
el: Ο μυστικός σύνδεσμος δημιουργήθηκε

source: Copy the link and the secret fragment separately.
el: Αντιγράψτε ξεχωριστά τον σύνδεσμο και το μυστικό κλειδί.

source: Unable to create secret link.
el: Δεν είναι δυνατή η δημιουργία του μυστικού συνδέσμου.

source: Unable to reach the vault service right now.
el: Δεν είναι δυνατή η πρόσβαση στην υπηρεσία θησαυροφυλακίου αυτή τη στιγμή.

source: Provide the secret fragment to the recipient separately; the server never stores it.
el: Δώστε το μυστικό κομμάτι ξεχωριστά στον παραλήπτη· ο διακομιστής δεν το αποθηκεύει ποτέ.

source: Password generator
el: Γεννήτρια κωδικών

source: Select at least one character set.
el: Επιλέξτε τουλάχιστον ένα σύνολο χαρακτήρων.

source: Password copied to clipboard.
el: Ο κωδικός αντιγράφηκε στο πρόχειρο.

source: File exceeds maximum allowed size.
el: Το αρχείο υπερβαίνει το μέγιστο επιτρεπόμενο μέγεθος.

source: File type not allowed.
el: Ο τύπος αρχείου δεν επιτρέπεται.

source: Unable to read this file.
el: Δεν είναι δυνατή η ανάγνωση αυτού του αρχείου.

source: Please wait for the file to finish loading.
el: Περιμένετε να ολοκληρωθεί η φόρτωση του αρχείου.

source: Search current chat
el: Αναζήτηση τρέχουσας συνομιλίας

source: Search decrypted messages in this room
el: Αναζήτηση αποκρυπτογραφημένων μηνυμάτων σε αυτόν τον χώρο

source: Type to filter the currently loaded chat history.
el: Πληκτρολογήστε για να φιλτράρετε το φορτωμένο ιστορικό συνομιλίας.

source: Point your camera at the QR to join instantly.
el: Κατευθύνετε την κάμερά σας στο QR για να μπείτε αμέσως.

source: Review the essentials or catch up on features without leaving the chat.
el: Ανασκοπήστε τα βασικά ή ενημερωθείτε για νέες δυνατότητες χωρίς να φύγετε από τη συζήτηση.

source: Logout
el: Αποσύνδεση

source: Settings
el: Ρυθμίσεις

source: New York
el: Νέα Υόρκη

source: London
el: Λονδίνο

source: Paris
el: Παρίσι

source: Athens
el: Αθήνα

source: Dubai
el: Ντουμπάι

source: Singapore
el: Σιγκαπούρη

source: Tokyo
el: Τόκιο

source: Sydney
el: Σίδνεϊ

source: Enable TOTP (authenticator app)
el: Ενεργοποίηση TOTP (εφαρμογή επαλήθευσης)

source: Save settings
el: Αποθήκευση ρυθμίσεων

source: Please fix the errors below:
el: Διορθώστε τα παρακάτω σφάλματα:

source: No account?
el: Δεν έχετε λογαριασμό;

source: Register
el: Εγγραφή

source: Please fix the issues below:
el: Διορθώστε τα παρακάτω ζητήματα:

source: Strong password + TOTP are mandatory.
el: Ισχυρός κωδικός και TOTP είναι υποχρεωτικά.

source: End-to-end encrypted group chat. Only those who share the hash can hear the whisper.
el: Κρυπτογραφημένη ομαδική συνομιλία άκρο-σε-άκρο. Μόνο όσοι μοιράζονται το hash μπορούν να ακούσουν τον ψίθυρο.

source: Create secure account
el: Δημιουργία ασφαλούς λογαριασμού

source: Sign in to %(app)s
el: Συνδεθείτε στο %(app)s

source: Disclaimer: Keep your shared secrets offline and private. If you lose them, we cannot recover your messages. Use %(app)s responsibly—do not use it for illegal activities. The author disclaims any liability for misuse or damages.
el: Αποποίηση: Κρατήστε τα κοινά μυστικά σας offline και ιδιωτικά. Αν τα χάσετε, δεν μπορούμε να ανακτήσουμε τα μηνύματά σας. Χρησιμοποιήστε το %(app)s υπεύθυνα—όχι για παράνομες δραστηριότητες. Ο δημιουργός αποποιείται κάθε ευθύνη για κακή χρήση ή ζημίες.

source: Licensed under
el: Άδεια υπό

source: by InsBhrs
el: από InsBhrs

source: Enter the 6-digit code from your authenticator app.
el: Εισάγετε τον 6-ψήφιο κωδικό από την εφαρμογή επαλήθευσης.

source: Secure your account
el: Ασφαλίστε τον λογαριασμό σας

source: Scan this QR with Google Authenticator (or any TOTP app). Two-factor is mandatory from first login.
el: Σαρώστε αυτό το QR με το Google Authenticator (ή άλλη εφαρμογή TOTP). Η διπλή επαλήθευση είναι υποχρεωτική από την πρώτη σύνδεση.

source: Proceed to sign in
el: Συνεχίστε στη σύνδεση

source: Built by IBSoft
el: Κατασκευή από IBSoft

source: Version
el: Έκδοση

source: Type an encrypted whisper...
el: Πληκτρολογήστε έναν κρυπτογραφημένο ψίθυρο...

source: Client-side cryptography!
el: Η κρυπτογραφία σου ανήκει!
